tap "buildpacks/tap"
tap "candid82/brew"
tap "cloudfoundry/tap"
tap "confluentinc/ccloud"
tap "confluentinc/confluent-hub-client"
tap "confluentinc/internal", "git@github.com:confluentinc/homebrew-internal.git"
tap "derailed/k9s"
tap "github/gh"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "kordamp/tap"
tap "rs/tap"
tap "weaveworks/tap"
tap "yqrashawn/goku"
tap "yurikoles/yurikoles"
brew "antigen", args: ["HEAD"]
brew "apr"
brew "boost"
brew "python@3.9"
brew "asciidoc"
brew "asciidoctor"
brew "asciinema"
brew "automake"
brew "awscli"
brew "python@3.8"
brew "azure-cli"
brew "bat"
brew "berkeley-db"
brew "libpng"
brew "dialog"
brew "certbot"
brew "cfssl"
brew "chicken"
brew "chruby"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "diff-so-fancy"
brew "dive"
brew "duck"
brew "exa"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fluxctl"
brew "fontforge"
brew "fzf"
brew "gh"
brew "gimme-aws-creds"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go-jira"
brew "goenv"
brew "gradle-completion"
brew "librsvg"
brew "graphviz"
brew "grc", args: ["HEAD"]
brew "grep"
brew "grpc"
brew "grpcurl"
brew "helm"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hyperkit"
brew "libheif"
brew "imagemagick"
brew "inetutils"
brew "iperf3"
brew "jfrog-cli"
brew "jid"
brew "oniguruma"
brew "jq"
brew "jsonnet"
brew "k3d"
brew "librdkafka"
brew "kafkacat"
brew "kubernetes-cli"
brew "kops"
brew "kube-linter"
brew "kube-ps1"
brew "kubebuilder"
brew "kubectx"
brew "kustomize"
brew "legit"
brew "lolcat"
brew "mackup"
brew "maven"
brew "maxwell"
brew "ninja"
brew "meson"
brew "micro"
brew "minikube"
brew "ncdu"
brew "nmap"
brew "node"
brew "nushell"
brew "octant"
brew "opam"
brew "socat"
brew "openshift-cli"
brew "pandoc"
brew "prettyping"
brew "pulumi"
brew "qcachegrind"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rlwrap"
brew "ruby-install"
brew "skaffold"
brew "speedtest-cli"
brew "sphinx-doc"
brew "subversion"
brew "terraform"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "uchardet"
brew "urlview"
brew "vault"
brew "watch"
brew "websocat"
brew "yarn"
brew "yq"
brew "z.lua"
brew "zplug"
brew "zsh", args: ["HEAD"]
brew "zsh-autosuggestions"
brew "buildpacks/tap/pack"
brew "cloudfoundry/tap/cf-cli"
brew "derailed/k9s/k9s"
brew "heroku/brew/heroku"
brew "kordamp/tap/gum"
brew "rs/tap/curlie"
brew "weaveworks/tap/eksctl"
brew "yqrashawn/goku/goku"
brew "yurikoles/yurikoles/far2l", args: ["HEAD"]
cask "alacritty"
cask "bloomrpc"
cask "brave-browser"
cask "caffeine"
cask "cakebrew"
cask "calibre"
cask "captain"
cask "cheatsheet"
cask "confluent-hub-client"
cask "cyberduck"
cask "dash"
cask "docker"
cask "dotnet-sdk"
cask "flutter"
cask "font-fira-code-nerd-font"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-nerd-font-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "fontforge"
cask "gitter"
cask "gitup"
cask "go2shell"
cask "google-cloud-sdk"
cask "iterm2"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kindle"
cask "kitematic"
cask "kubernetic"
cask "lastpass"
cask "marta"
cask "minikube"
cask "noun-project"
cask "obs"
cask "paparazzi"
cask "plex-media-player"
cask "qlstephen"
cask "reaper"
cask "rocket"
cask "sampler"
cask "skitch"
cask "soundflower"
cask "soundflowerbed"
cask "sublime-text-dev"
cask "taskpaper"
cask "textexpander"
cask "tower"
cask "transmission"
cask "ukelele"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "wavebox"
cask "xquartz"
