tap "atomicjar/tap"
tap "bufbuild/buf"
tap "buildpacks/tap"
tap "confluentinc/confluent-hub-client"
tap "confluentinc/tap"
tap "derailed/k9s"
tap "derailed/popeye"
tap "etolbakov/taps"
tap "hashicorp/tap"
tap "heroku/brew"
tap "koekeishiya/formulae"
tap "kong/deck"
tap "kordamp/tap"
tap "koyeb/tap"
tap "ktr0731/evans"
tap "olets/tap"
tap "productdevbook/tap"
tap "restatedev/tap"
tap "risingwavelabs/risingwave"
tap "rs/tap"
tap "supabase/tap"
tap "tinygo-org/tools"
tap "yurikoles/yurikoles"
# Run your GitHub Actions locally
brew "act"
# New file format for still image compression
brew "jpeg-xl"
# OpenType text shaping engine
brew "harfbuzz"
# Scalable batch and stream data processing
brew "apache-flink"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Simple system information tool written in Python
brew "archey4"
# Collection of portable C++ source libraries
brew "boost"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# YAML Parser
brew "libyaml"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Record and share terminal sessions
brew "asciinema"
# Send macOS notifications from the command line (used by Claude Code Stop hook)
# alerter is a modern Swift rewrite of terminal-notifier that works on macOS 13+
brew "alerter"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Configuration editing tool and API
brew "augeas"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# High performance key/value database
brew "berkeley-db", link: true
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Parser generator
brew "bison"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CloudFlare's PKI toolkit
brew "cfssl"
# Schema and validator for YAML
brew "yamale"
# Testing and linting Helm charts
brew "chart-testing"
# Compiler for the Scheme programming language
brew "chicken"
# Ruby environment tool
brew "chruby"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Top-like interface for container metrics
brew "ctop"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Display user-friendly message boxes from shell scripts
brew "dialog"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line tools for fly.io services
brew "flyctl"
# Fast and simple Node.js version manager
brew "fnm"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Multi-format archive and compression library
brew "libarchive"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# CLI to retrieve AWS credentials from Okta
brew "gimme-aws-creds"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Quickly rewrite git repository history
brew "git-filter-repo"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simple jira command-line client in Go
brew "go-jira"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go version management
brew "goenv"
# Fast linters runner for Go
brew "golangci-lint"
# Ping, but with a graph
brew "gping", link: false
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Next generation open source RPC library and framework
brew "grpc"
# Interactive web UI for gRPC, along the lines of postman
brew "grpcui"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Istio configuration command-line utility
brew "istioctl"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Open-source distributed event streaming platform
brew "kafka"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Run local Kubernetes cluster in Docker
brew "kind"
# Command-line interface for managing Knative Serving and Eventing resources
brew "kn"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Static analysis tool for Kubernetes YAML files and Helm charts
brew "kube-linter"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Kuma control plane command-line utility
brew "kumactl"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# DNS library written in C
brew "ldns"
# Python 2 and 3 compatibility utilities
brew "six"
# Command-line interface for Git, optimized for workflow simplicity
brew "legit"
# Pager program similar to more
brew "less"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Portable Foreign Function Interface library
brew "libffi"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Keep your Mac's application settings in sync
brew "mackup"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Reads MySQL binlogs and writes row updates as JSON to Kafka
brew "maxwell"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# NCurses Disk Usage
brew "ncdu"
# HTTP and WebDAV client library with a C interface
brew "neon"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# OCaml package manager
brew "opam"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk@11"
# OpenShift command-line interface tools
brew "openshift-cli"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF processor written in Go
brew "pdfcpu"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Realtime distributed OLAP datastore
brew "pinot"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Terminal slideshow tool
brew "presenterm"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Cloud native development platform
brew "pulumi"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# Cross-platform application and UI framework
brew "qt@5"
# AI-powered command-line workflow tool for developers
brew "qwen-code"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal based presentation tool
brew "slides"
# SOcket CAT: netcat on steroids
brew "socat"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Version control system designed to be a better CVS
brew "subversion"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# General purpose fuzzy finder TUI
brew "television"
# Official documentation format of the GNU project
brew "texinfo"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# CPU, RAM memory, and load monitor for use with tmux
brew "tmux-mem-cpu-load"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Distributed SQL query engine for big data
brew "trino"
# Encoding detector library
brew "uchardet"
# URL extractor/launcher
brew "urlview"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv", link: false
# Your CLI home video recorder
brew "vhs"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Bundler for JavaScript and friends
brew "webpack"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# HTTP benchmarking tool
brew "wrk"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# New cd command that helps you navigate faster by learning your habits
brew "z.lua"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Zlib replacement with optimizations for next generation systems
brew "zlib-ng"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# CLI for Confluent Cloud and Confluent Platform
brew "confluentinc/tap/cli"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye"
# Rust-based utility to convert docker-compose.yaml files into excalidraw files.
brew "etolbakov/taps/excalidocker"
# Terraform
brew "hashicorp/tap/terraform"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Declarative configuration for Kong
brew "kong/deck/deck"
# Gum is a Gradle/Maven/Ant/Bach/JBang wrapper written in Go
brew "kordamp/tap/gum"
brew "koyeb/tap/koyeb"
# Evans: more expressive universal gRPC client
brew "ktr0731/evans/evans"
# Auto-expanding abbreviations manager for zsh, inspired by fish
brew "olets/tap/zsh-abbr"
# Restate CLI
brew "restatedev/tap/restate"
# Restate Server
brew "restatedev/tap/restate-server"
# Distributed SQL database for stream processing
brew "risingwavelabs/risingwave/risingwave"
# The power of curl, the ease of use of httpie.
brew "rs/tap/curlie"
# Supabase CLI
brew "supabase/tap/supabase"
# TinyGo is a Go compiler for small places. Microcontrollers, WebAssembly, and command-line tools. Based on LLVM.
brew "tinygo-org/tools/tinygo"
# Linux port of FAR Manager v2
brew "yurikoles/yurikoles/far2l", args: ["HEAD"]
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Screensavers inspired by Braun watches
cask "clocksaver"
# Enables developers to manage Confluent Cloud or Confluent Platform
cask "confluent-cli"
cask "confluentinc/confluent-hub-client/confluent-hub-client"
# Server and cloud storage browser
cask "cyberduck"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-3270-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata"
cask "font-inter"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-kolker-brush"
cask "font-lobster"
cask "font-m+-nerd-font"
cask "font-m-plus-1"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-montserrat"
cask "font-montserrat-alternates"
cask "font-mulish"
cask "font-raleway"
cask "font-roboto-mono-for-powerline"
cask "font-rounded-mplus"
cask "font-sniglet"
cask "font-space-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
# GIT client
cask "fork"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git interface focused on visual interaction
cask "gitup-app"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Vector graphics editor
cask "inkscape"
# CLI HTTP and GraphQL Client
cask "inso"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Kubernetes desktop client
cask "kubernetic"
# Adaptive brightness for external displays
cask "lunar"
# Extensible two-pane file manager
cask "marta"
# Minimal installer for conda
cask "miniconda"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Interact with Ollama models
cask "ollamac"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to take screenshots of webpages
cask "paparazzi"
# Menu bar app to find and kill processes running on open ports
cask "productdevbook/tap/portkiller"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Archive manager for data compression and backups
cask "rar"
# Digital audio production application
cask "reaper"
# Emoji picker optimised for blind people
cask "rocket"
# Detects which app receives a keyboard shortcut (hotkey)
cask "shortcutdetective"
# App to make lists and help with organisation
cask "taskpaper"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# Tescontainers desktop application for local testing and development
cask "atomicjar/tap/testcontainers-desktop"
# Open-source BitTorrent client
cask "transmission"
# Unicode keyboard layout editor
cask "ukelele"
# Development environment
cask "vagrant"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# All-in-One Java Troubleshooting Tool
cask "visualvm"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Bluetooth+", id: 1538895885
mas "Bluey's Quest", id: 6499386030
mas "Capital One Shopping", id: 1477110326
mas "Caramba Switcher", id: 1565826179
mas "CardPointers", id: 1472875808
mas "Codye", id: 1516894961
mas "Control Panel for Twitter", id: 1668516167
mas "Control Panel for YouTube", id: 6478456678
mas "Developer", id: 640199958
mas "Display Menu", id: 549083868
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Endel", id: 1346247457
mas "Fantastical", id: 975937182
mas "Flighty", id: 1358823008
mas "GarageBand", id: 682658836
mas "Geekbench 5", id: 1478447657
mas "Grammarly for Safari", id: 1462114288
mas "Health Auto Export", id: 1115567069
mas "Highland 2", id: 1171820258
mas "Highland Pro", id: 6612007609
mas "HP", id: 1474276998
mas "HP Easy Scan", id: 967004861
mas "iMovie", id: 408981434
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 361285480
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Klack", id: 6446206067
mas "Lang Switcher", id: 1597566195
mas "LanguageTool", id: 1534275760
mas "Marked 3", id: 0
mas "MindNode Classic", id: 1289197285
mas "MonitorControlLite", id: 1595464182
mas "Moom Classic", id: 419330170
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Perplexity", id: 6714467650
mas "Pixelmator", id: 407963104
mas "Pixelmator Pro", id: 6746662575
mas "Pocket", id: 568494494
mas "Podcast Chapters", id: 1070963477
mas "Prime Video", id: 545519333
mas "RecurseChat", id: 6476835702
mas "Reeder", id: 1449412482
mas "Refined GitHub", id: 1519867270
mas "RunCat", id: 1429033973
mas "Save to Pocket", id: 1477385213
mas "SessionRestore", id: 1463334954
mas "ShellHistory", id: 1564015476
mas "Slack", id: 803453959
mas "Speechify", id: 1624912180
mas "Speedtest", id: 1153157709
mas "Swift Playground", id: 1496833156
mas "Telegram", id: 747648890
mas "Teleprompter", id: 1533078079
mas "TestFlight", id: 899247664
mas "The Clock", id: 488764545
mas "TripIt", id: 1475712010
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
vscode "1schema.tldr"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "anandabibekray.intellij-idea-new-ui-theme"
vscode "andrewm098.onelight-pro"
vscode "anthropic.claude-code"
vscode "asciidoctor.asciidoctor-vscode"
vscode "brennondenny.vsc-jetbrains-icons-enhanced"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "confluentinc.vscode-confluent"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "drblury.protobuf-vsc"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "fabiospampinato.vscode-todo-plus"
vscode "flobilosaurus.vscode-asciidoc-slides"
vscode "gera2ld.markmap-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "irongeek.vscode-env"
vscode "k--kato.intellij-idea-keybindings"
vscode "laggardkernel.vscode-theme-onelight"
vscode "loilo.snazzy-light"
vscode "mathiasfrohlich.kotlin"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "nefrob.vscode-just-syntax"
vscode "oracle.oracle-java"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ryuta46.multi-command"
vscode "streetsidesoftware.avro"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tomaszbartoszewski.avro-tools"
vscode "vikgamov.calliope-md"
vscode "vikgamov.vscode-open-in-marked2"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
vscode "wiratama.flink-sql-toolkit"
vscode "xyz.local-history"
vscode "zerodind.familiar-java-themes"
vscode "znck.grammarly"
go "github.com/bufbuild/buf/cmd/buf"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/pquerna/ffjson"
go "github.com/onsi/ginkgo/ginkgo"
go "github.com/ramya-rao-a/go-outline"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "github.com/olivere/iterm2-imagetools/cmd/imgcat"
go "github.com/josharian/impl"
go "github.com/kong/kubernetes-testing-framework/cmd/ktf"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/kong/go-wrpc/cmd/protoc-gen-go-wrpc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-grpc-gateway"
go "github.com/kumahq/protoc-gen-kumadoc"
go "github.com/grpc-ecosystem/grpc-gateway/v2/protoc-gen-openapiv2"
go "github.com/envoyproxy/protoc-gen-validate"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-generate"
cargo "renvsubst"
cargo "wasm-pack"
uv "specify-cli"
krew "ctx"
krew "krew"
krew "neat"
krew "ns"
# Smart tmux session manager — shell-first entry point to tmux sessions
brew "sesh"
# Terminal UI for git commands (invoked via `prefix + g` tmux popup)
brew "lazygit"
# Markdown renderer — used for the `prefix + ?` cheat-sheet popup
brew "glow"
