tap "atomicjar/tap"
tap "bufbuild/buf"
tap "buildpacks/tap"
tap "candid82/brew"
tap "cantino/mcfly"
tap "chipmk/tap"
tap "cloudfoundry/tap"
tap "confluentinc/ccloud"
tap "confluentinc/confluent-hub-client"
tap "derailed/k9s"
tap "derailed/popeye"
tap "github/gh"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "knative/client"
tap "koekeishiya/formulae"
tap "kong/deck"
tap "kong/kong"
tap "kordamp/tap"
tap "koyeb/tap"
tap "ktr0731/evans"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "olets/tap"
tap "openresty/brew"
tap "rs/tap"
tap "supabase/tap"
tap "tinygo-org/tools"
tap "ubuntu/microk8s"
tap "weaveworks/tap"
tap "yqrashawn/goku"
tap "yurikoles/yurikoles"
brew "act"
brew "jpeg-xl"
brew "apr-util"
brew "readline"
brew "python@3.11"
brew "archey4"
brew "boost"
brew "gdbm"
brew "openssl@1.1"
brew "python@3.10"
brew "asciidoc"
brew "libyaml"
brew "asciidoctor"
brew "asciinema"
brew "automake"
brew "coreutils"
brew "asdf"
brew "augeas"
brew "awscli"
brew "azure-cli"
brew "oniguruma"
brew "bat"
brew "bazelisk"
brew "berkeley-db", link: true
brew "bison"
brew "bottom"
brew "broot"
brew "btop"
brew "cfssl"
brew "yamale"
brew "chart-testing"
brew "chicken"
brew "chruby"
brew "cmake"
brew "unbound"
brew "gnutls"
brew "libffi"
brew "python@3.9"
brew "qemu"
brew "lima"
brew "colima"
brew "cowsay"
brew "ctop"
brew "curl"
brew "dialog"
brew "diff-so-fancy"
brew "dive"
brew "docker-credential-helper"
brew "duf"
brew "dust"
brew "eksctl"
brew "exa"
brew "exiftool"
brew "fd"
brew "harfbuzz"
brew "libarchive"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "flyctl"
brew "freetds"
brew "fzf"
brew "gdk-pixbuf"
brew "geoip"
brew "gh"
brew "gimme-aws-creds"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go-jira"
brew "gobject-introspection"
brew "goenv"
brew "golangci-lint"
brew "gping"
brew "gradle-completion"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grc"
brew "grep"
brew "grpc"
brew "grpcui"
brew "grpcurl"
brew "helm"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "inetutils", link: false
brew "iperf3"
brew "istioctl"
brew "jid"
brew "jq"
brew "jsonnet"
brew "k3d"
brew "librdkafka"
brew "kcat"
brew "kind"
brew "kn"
brew "kubernetes-cli"
brew "kops"
brew "kube-linter"
brew "kube-ps1"
brew "kubebuilder"
brew "kubectx"
brew "kubie"
brew "kumactl"
brew "kustomize"
brew "legit"
brew "less"
brew "lolcat"
brew "lsd"
brew "lua"
brew "mackup"
brew "mas"
brew "maven"
brew "maxwell"
brew "ninja"
brew "meson"
brew "micro"
brew "minikube"
brew "ncdu"
brew "neofetch"
brew "neon"
brew "netcat"
brew "nmap"
brew "node"
brew "nushell"
brew "opam"
brew "openshift-cli"
brew "openssh"
brew "pandoc"
brew "perl"
brew "php"
brew "postgresql@14"
brew "prettyping"
brew "pulumi"
brew "qt@5"
brew "qcachegrind"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rlwrap"
brew "ruby-install"
brew "saml2aws"
brew "shellcheck"
brew "skaffold"
brew "sl"
brew "socat"
brew "speedtest-cli"
brew "sphinx-doc"
brew "stern"
brew "subversion"
brew "terraform"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "uchardet"
brew "urlview"
brew "watch"
brew "websocat"
brew "wget"
brew "whalebrew"
brew "wrk"
brew "wxwidgets"
brew "yarn"
brew "yq"
brew "z.lua"
brew "zlib-ng"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "bufbuild/buf/buf"
brew "buildpacks/tap/pack"
brew "cantino/mcfly/mcfly"
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "kong/deck/deck"
brew "kordamp/tap/gum"
brew "koyeb/tap/koyeb"
brew "ktr0731/evans/evans"
brew "olets/tap/zsh-abbr"
brew "rs/tap/curlie"
brew "supabase/tap/supabase"
brew "tinygo-org/tools/tinygo"
brew "ubuntu/microk8s/microk8s"
brew "yurikoles/yurikoles/far2l", args: ["HEAD"]
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "brave-browser"
cask "caffeine"
cask "calibre"
cask "chatgpt"
cask "cheatsheet"
cask "clocksaver"
cask "confluent-hub-client"
cask "cyberduck"
cask "dash"
cask "dotnet-sdk"
cask "firefox"
cask "firefox-developer-edition"
cask "flutter"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "font-lobster"
cask "font-lobster-two"
cask "font-m-plus-1"
cask "font-mplus-nerd-font"
cask "font-roboto"
cask "font-roboto-mono-for-powerline"
cask "font-rounded-mplus"
cask "font-source-code-pro"
cask "font-space-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "fork"
cask "gitup"
cask "go2shell"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "inso"
cask "karabiner-elements"
cask "keepingyouawake"
cask "kubernetic"
cask "marta"
cask "mountain-duck"
cask "multipass"
cask "obs"
cask "orbstack"
cask "paparazzi"
cask "qlstephen"
cask "rar"
cask "reaper"
cask "restream-chat"
cask "rocket"
cask "smartgit"
cask "soundflowerbed"
cask "taskpaper"
cask "testcontainers-desktop"
cask "tower"
cask "transmission"
cask "ukelele"
cask "vagrant"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whisky"
cask "wireshark"
cask "xquartz"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Blackmagic RAW Speed Test", id: 1466185689
mas "Bluetooth+", id: 1538895885
mas "Display Menu", id: 549083868
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Geekbench 5", id: 1478447657
mas "Grammarly for Safari", id: 1462114288
mas "Highland 2", id: 1171820258
mas "iMovie", id: 408981434
mas "Jiffy", id: 1502527999
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "LanguageTool", id: 1534275760
mas "MindNode", id: 1289197285
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Pixelmator", id: 407963104
mas "Playgrounds", id: 1496833156
mas "Pocket", id: 568494494
mas "Podcast Chapters", id: 1070963477
mas "PopClip", id: 445189367
mas "Prime Video", id: 545519333
mas "Reeder", id: 1449412482
mas "Refined GitHub", id: 1519867270
mas "RunCat", id: 1429033973
mas "Save to Pocket", id: 1477385213
mas "SessionRestore", id: 1463334954
mas "ShellHistory", id: 1564015476
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Telegram", id: 747648890
mas "Teleprompter", id: 1533078079
mas "The Clock", id: 488764545
mas "TripIt", id: 1475712010
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1497506650
whalebrew "kong/deck"
vscode "42Crunch.vscode-openapi"
vscode "andrewm098.OneLight-Pro"
vscode "asciidoctor.asciidoctor-vscode"
vscode "DotJoshJohnson.xml"
vscode "dwenegar.vscode-luacheck"
vscode "EditorConfig.EditorConfig"
vscode "fabiospampinato.vscode-todo-plus"
vscode "flobilosaurus.vscode-asciidoc-slides"
vscode "fmoronzirfas.open-in-marked"
vscode "gera2ld.markmap-vscode"
vscode "golang.go"
vscode "googlecloudtools.cloudcode"
vscode "inercia.vscode-k3d"
vscode "jspolancor.presentationmode"
vscode "k--kato.intellij-idea-keybindings"
vscode "laggardkernel.vscode-theme-onelight"
vscode "mathiasfrohlich.Kotlin"
vscode "mauricedebeijer.presentation-buddy"
vscode "mermade.openapi-lint"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "philosowaffle.openapi-designer"
vscode "redhat.vscode-knative"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sianglim.slim"
vscode "stayfool.vscode-asciidoc"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "wayou.vscode-todo-highlight"
vscode "znck.grammarly"
vscode "zxh404.vscode-proto3"
